import { array, object, string } from "yup";

export const BlogSchema = object({
  blogTitle: string()
    .min(20, "عنوان باید بیش از 20 کاراکتر باشد")
    .max(60, "عنوان باید کوتاه تر از 60 کاراکتر باشد")
    .matches(
      /^[\p{L}\p{N} .,_\-!?]+$/u,
      "این متن فقط می‌تواند شامل حروف، اعداد، فاصله  . ، _  - ؟ ? ! باشد"
    )
    .required("وارد کردن عنوان الزامی است"),
  blogDescription: string()
    .min(50, "توضیحات باید بیش از 50 کاراکتر باشد")
    .max(150, "توضیحات باید کوتاه تر از 150 کاراکتر باشد")
    .matches(
      /^[\p{L}\p{N} .,_\-!?]+$/u,
      "این متن فقط می‌تواند شامل حروف، اعداد، فاصله  . ، _  - ؟ ? ! باشد"
    ),
  blogImage: string()
    .url("تصویر باید یک آدرس URL معتبر باشد")
    .required("وارد کردن آدرس تصویر الزامی است"),
  blogCategory: array(string()),
  // CHANGE FOR PRODUCTION
  textEditor: string(),
  blogTags: string(),
  // .test(
  //   "is-json",
  //   "مقدار باید یک رشته معتبر JSON باشد",
  //   (value) => {
  //     try {
  //       if (value) JSON.parse(value);
  //       return true;
  //     } catch {
  //       return false;
  //     }
  //   }
  // ),
});

export const CategorySchema = object({
  id: string(),
  title: string()
    .min(5, "عنوان دسته بندی باید بیش از 5 کاراکتر باشد")
    .max(25, "عنوان دسته بندی باید کوتاه تر از 25 کاراکتر باشد")
    .matches(/^[\p{Script=Arabic} ]+$/u, "فقط حروف فارسی و فاصله مجاز است")
    .required("وارد کردن عنوان الزامی است"),
  name: string()
    .min(3, "شناسه دسته بندی باید بیش از 3 کاراکتر باشد")
    .max(25, "شناسه دسته بندی باید کوتاه تر از 25 کاراکتر باشد")
    .matches(
      /^[a-z]+(-[a-z]+)*$/i,
      "شناسه دسته بندی باید با حروف انگلیسی شروع و پایان یابد ، تک - مجاز است"
    )
    .required("وارد کردن شناسه الزامی است"),
});
export const TagSchema = object({
  id: string(),
  tagTitle: string()
    .min(3, "عنوان برچسب باید بیش از 3 کاراکتر باشد")
    .max(25, "عنوان برچسب باید کوتاه تر از 3 کاراکتر باشد")
    .matches(/^[\p{Script=Arabic} ]+$/u, "فقط حروف فارسی و فاصله مجاز است")
    .required("وارد کردن عنوان الزامی است"),
  tagSlug: string()
    .min(3, "شناسه برچسب باید بیش از 3 کاراکتر باشد")
    .max(25, "شناسه برچسب  باید کوتاه تر از 3 کاراکتر باشد")
    .matches(
      /^[a-z]+(-[a-z]+)*$/i,
      "شناسه برچسب باید با حروف انگلیسی شروع و پایان یابد ، تک - مجاز است "
    )
    .required("وارد کردن شناسه الزامی است"),
});
export const SliderSchema = object({
  id: string(),
  titleSlide: string()
    .min(15, "عنوان اسلایدر باید بیش از 15  کاراکتر باشد")
    .max(150, "عنوان اسلایدر باید کوتاه تر از 150 کاراکتر باشد")
    .matches(/^[\u0600-\u06FF\s0-9؟!]+$/u, "فقط حروف فارسی و فاصله مجاز است")
    .required("وارد کردن عنوان الزامی است"),
  imageSlide: string()
    .url("این آدرس URL معتبر نیست")
    .required("وارد کردن آدرس تصویر الزامی است"),
  bgColor: string().matches(
    /^#[0-9A-Fa-f]{6}$/,
    "فرمت رنگ پس زمینه به درستی تنظیم نشده است"
  ),
  textColor: string().matches(
    /^#[0-9A-Fa-f]{6}$/,
    "فرمت رنگ متن به درستی تنظیم نشده است"
  ),
  typeSlide: string(),
});
export const ContactSchema = object({
  fullName: string()
    .min(5, "نام باید بیش از 5 کاراکتر باشد")
    .max(60, "نام باید کوتاه تر از 60 کاراکتر باشد")
    .matches(
      /^[\p{L}0-9._ -]*$/u,
      "نام تنها می‌تواند شامل حروف ، اعداد و - _ . باشد "
    )
    .required("وارد کردن نام الزامی است"),
  email: string()
    .email("این فیلد باید حاوی ایمیل معتبر باشد")
    .min(6, "ایمیل باید بیش از 5 کاراکتر باشد")
    .max(100, "ایمیل باید کوتاه تر از 100 کاراکتر باشد")
    .required("وارد کردن ایمیل الزامی است"),
  message: string()
    .min(20, "متن پیام باید بیش از 20 کاراکتر باشد")
    .max(500, "متن پیام باید کوتاه تر از 500 کاراکتر باشد")
    .matches(/^[\p{L}\p{N} \.,؛،!?'"()\n\r-]+$/u)
    .required("وارد کردن پیام الزامی است"),
});
